// HTML теги - это javascript объекты или узлы
// У нас есть 12 типов узлов в js
// На практике используется 3-4 узла

// Element - картинки и прочие блоки
// Attr - атрибуты картинки
// Текстовые узлы
// Текст

// Три кита JS

// BOM -
// DOM - объектная модель документа
// ECMAScript -

// Когда появляется?

// NodeList - это псевдомассив(ArrayLikeObject)

// console.log()

// Нужно пользоватся 2 селекторами document.selector и document.selectorAll

// Работа с классами

// с 20-00  Смотреть про обращения к классам
