// Функциональные методы массивов

// Императиный стиль

// Declarative стиль написания код

// Методы массивов

// forEach - нужен, чтобы вывести что-то из массива (тут нельзя ничего вернуть, он предназначен для перебора) при попытке вернуть будет андефайн
// map - (должен что-то вернуть) используется для возврата значений  из массива Он приобразовует и отдет значение

// ... наследует свойство у у переменной и отдает переменной внутри которой он был объявоенs

// filter - возврашает массив или пустой массив (Если он ничего не найдет) если в ключе булевое значние, то можно сразу вернуть значение, которое Тру или false, также будет работать оператор!

// find - находит первое совподение (Только одно!!) filter вернет все совпадения. А если не найдет, то вернет undefinde

// Закончил на 1 часе 30 минуте

// Every - returns true если каждый елемент попадает под условие которое передано в return
// Some - Если попадает хотябы один под условие return

// Сортировк;

// let number = [1, 23, 45, 67];

// let result = number.sort(function (a, b) {
//   return a - b;
// });

// console.log(result);

// reduce = Принимает в себя 4 аргумента (аккаумулятор, element)

// Каждый из методов возвращает массив!!!!  и не обязательно заносить его в переменную

// Ченинг - это комбинация нескольких методов ( к примеру )

// split -
// reverse -
// join -

// Можно делать ченинг этих методов между собой

// Нужно писать используя деструктуризацию и не использовать find

// Старатся не выводить Ретурны и делать стрелочные функции
